#+seq_TODO: NEXT(n) TODO(t) WAITING(w) SOMEDAY(s) IN-PROG(p) REPEAT(r) | DONE(d) CANCELLED(c)
#+STARTUP: nologrepeat
#+TAGS: DEPTH(d) IMPLEMENT(i) SKIM(s) ONE-TIME(o)
#+PRIORITIES 1 5 3

** Example Task 1 
   :PROPERTIES:
   :ID:       b83dd25e-2c2f-456e-8d69-580c0fdc9244
   :END:
   :LOGBOOK:
   CLOCK: [2020-12-17 Thu 19:38]--[2020-12-17 Thu 20:08] =>  0:30
   CLOCK: [2020-12-17 Thu 19:33]--[2020-12-17 Thu 19:34] =>  0:01
   :END:
** Example Task 2 
   :PROPERTIES:
   :ID:       97b5c704-fa12-45f8-9542-48afff233e6c
   :END:
   :LOGBOOK:
   CLOCK: [2020-12-17 Thu 19:37]--[2020-12-17 Thu 19:38] =>  0:01
   CLOCK: [2020-12-17 Thu 19:37]--[2020-12-17 Thu 19:37] =>  0:00
   CLOCK: [2020-12-17 Thu 19:35]--[2020-12-17 Thu 19:36] =>  0:01 
   :END:

We can also log breaks. If we clock out of a task, we can clock back into that previous task with C-c C-x C-x

Suppose we mostly work on just a few tasks throughout the day. We can get a menu of tasks with C-u C-c C-x C-x . With this we can choose a task to clock into from recent tasks. 

If we want to see the data on the tasks we have been working on, we can do C-c C-x C-d for an overview of how much time has been spent overall on each task.

** Another Task
   :PROPERTIES:
   :Effort:   0:05
   :ID:       44a42b37-afa0-4221-93fa-60a8859e0e7c
   :END:
   :LOGBOOK:
   CLOCK: [2020-12-17 Thu 20:11]--[2020-12-17 Thu 20:28] =>  0:17
   CLOCK: [2020-12-17 Thu 20:08]--[2020-12-17 Thu 20:10] =>  0:02
   :END:

** A different task                                                 :ORDERED:
   :PROPERTIES:
   :Effort:   0:30
   :ORDERED:  t
   :ID:       9e5785e0-146d-4649-b634-43d0baf81113
   :END:
   :LOGBOOK:
   CLOCK: [2020-12-17 Thu 20:11]--[2020-12-17 Thu 20:11] =>  0:00
   CLOCK: [2020-12-17 Thu 20:11]--[2020-12-17 Thu 20:11] =>  0:00
   :END:

#+TITLE: Linking, Attachments, and More

